package thread;

/**
 * @Auther: ccy
 * @Date: 2020/9/14 - 19:33
 * @Description:
 * @version: 1.0
 */
public class 进程$线程的概念 {
    /**
     * 程序:一个指令的集合,最终都是要都到cpu中翻译成指令集运行的(代码,类,方法)
     * 进程:1 正在执行中的程序,占用特定的地址空间(磁盘,内存)
     *     2 每个进程都是相互独立的,由3部分组成cpu(运算器),data(数据),code(具体的执行逻辑)
     *     缺点:进程开的多的话,会造成内存的浪费,cpu的负担
     * 进程不是并行执行的
     * 线程:1 进程中一个单一的连续控制流程
     *       例如:百度网盘是一个进程,然后有五个任务在同时进行下载,而这五个任务就是线程,进程获取了内存空间,资源,五个线程共享这些资源
     *     2  线程是轻量级进程
     *     3  一个进程可拥有多个并行的线程
     *     4  一个进程中的线程共享相同的内存单元/内存地址空间->可以访问相同的变量和对象,而且它们从同一堆中分配对象->通信,数据交换,同步操作
     *     5  由于线程间的通信是在同一地址空间上进行的,所以不需要额外的通信机制,这就使得通信更简单而且信息传递的速度更快
     *
     *     (进程是申请资源的最小单位,进程分为一个或多个线程)
    */
}
